Repository: quantus/wtforms
Catalog: wtforms/ext/i18n/messages/*/LC_MESSAGES/wtforms.po
Languages: fi, it

source: %(field_label)s must be equal to %(other_name)s.
fi: Kentän %(field_label)s arvo täytyy olla sama kuin kentällä %(other_name)s.

source: %(field_label)s must be at least %(min)d character long.
fi: %(field_label)s täytyy olla vähintään yhden merkin pituinen.

source: %(field_label)s cannot be longer than %(max)d character.
fi: %(field_label)s saa olla enintään yhden merkin pituinen.

source: %(field_label)s must be between %(min)d and %(max)d characters long.
fi: %(field_label)s täytyy olla vähintään %(min)d ja enintään %(max)d merkkiä pitkä.

source: %(field_label)s must be at most %(max)s.
fi: %(field_label)s saa olla enintään %(max)s.

source: %(field_label)s must be between %(min)s and %(max)s.
fi: %(field_label)s täytyy olla vähintään %(min)s ja enintään %(max)s.

source: %(field_label)s is required.
fi: %(field_label)s on pakollinen.

source: Invalid input.
fi: Vääräsyöte.
it: Dato invalido.

source: Invalid email address.
fi: Virheellinen sähköpostiosoite.
it: Indirizzo e-mail invalido.

source: Invalid IP address.
fi: Virheellinen IP-osoite.
it: Indirizzo IP invalido.

source: Invalid Mac address.
fi: Virheellinen Mac-osoite.
it: Mac address invalido.

source: Invalid URL.
fi: Virheellinen osoite.
it: URL invalido.

source: Invalid UUID.
fi: Virheellinen UUID.
it: UUID invalido.

source: Invalid value, must be one of: %(values)s.
fi: Virheellinen arvo, täytyy olla joku seuraavista: %(values)s.
it: Valore invalido, deve essere uno tra: %(values)s.

source: Invalid value, can't be any of: %(values)s.
fi: Virheellinen arvo, ei saa olla mikään seuraavista: %(values)s.
it: Valore invalido, non può essere nessuno tra %(values)s.

source: Not a valid choice
fi: Virheellinen valinta.
it: Non è un'opzione valida

source: Not a valid list
fi: Ei ole kelvollinen lista.
it: Non è una lista valida

source: Invalid CSRF Token
fi: Virheellinen CSRF token.
it: Token CSRF invalido

source: CSRF token missing
fi: CSRF token puuttuu.
it: Token CSRF mancante

source: CSRF failed
fi: CSRF epäonnistui.
it: CSRF fallito

source: CSRF token expired
fi: CSRF token vanhentui.
it: Token CSRF scaduto

source: Please input a date/time value
fi: Syötä päivä/aika arvo.
it: Prego inserisci un valore data/ora

source: Invalid date/time input
fi: Virheellinen päivämäärä.
it: Inserimento data/ora non valido

source: Already exists.
fi: On jo olemassa.

source: Invalid Choice: could not coerce
fi: Virheellinen tyypin pakottaminen.
it: Scelta invalida: impossibile forzare

source: Invalid choice(s): one or more data inputs could not be coerced
fi: Virheelliset valinnat: yhtä tai useampaa syötteen tyyppiä ei pystytty muuttamaan.
it: Scelta(e) invalida: uno o più valori non possono essere forzati

source: '%(value)s' is not a valid choice for this field
fi: '%(value)s' ei ole oikea valinta tälle kentälle
it: '%(value)s' non è una scelta valida per questo campo

source: Not a valid integer value
fi: Ei ole oikea kokonaisluku.
it: Non è un valore intero valido

source: Not a valid decimal value
fi: Ei ole oikea desimaaliluku.
it: Non è un valore decimale valido

source: Not a valid float value
fi: Ei ole oikea desimaaliluku.
it: Non è un valore reale valido

source: Not a valid datetime value
fi: Ei ole oikea päivämäärä.

source: Not a valid date value
fi: Ei ole oikea päivä.

source: Invalid field name '%s'.
it: Nome del campo non valido '%s'.
